exercises/4-5/boundary_layer_1D/Allrun
#!/bin/sh
cd "${0%/*}" || exit
. ${ML_CFD_BASE}/RunFunctions
#------------------------------------------------------------------------------

# dummy file for post-processing with paraview
touch post.foam

# mesh creation
runApplication blockMesh

# solver execution
runApplication pimpleFoam

#------------------------------------------------------------------------------
